<center>
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/Logos/organization_logo/organization_logo.png" width="300" alt="cognitiveclass.ai logo"  />
</center>

# Working with a real world data-set using SQL and Python

Estimated time needed: **30** minutes

## Objectives

After completing this lab you will be able to:

-   Understand the dataset for Chicago Public School level performance
-   Store the dataset in an Db2 database on IBM Cloud instance
-   Retrieve metadata about tables and columns and query data from mixed case columns
-   Solve example problems to practice your SQL skills including using built-in database functions

## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: [https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_email=Email&utm_source=Nurture&utm_content=000026UJ&utm_term=10006555&utm_campaign=PLACEHOLDER&utm_id=SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838)

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: [https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true](https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true&utm_email=Email&utm_source=Nurture&utm_content=000026UJ&utm_term=10006555&utm_campaign=PLACEHOLDER&utm_id=SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838)

**NOTE**: 

Do not download the dataset directly from City of Chicago portal. Instead download a static copy which is a more database friendly version from this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_edX/data/Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012-v3.csv">link</a>.

Now review some of its contents.

### Store the dataset in a Table

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. To analyze the data using SQL, it first needs to be stored in the database.

While it is easier to read the dataset into a Pandas dataframe and then PERSIST it into the database as we saw in the previous lab, it results in mapping to default datatypes which may not be optimal for SQL querying. For example a long textual field may map to a CLOB instead of a VARCHAR. 

Therefore, **it is highly recommended to manually load the table using the database console LOAD tool, as indicated in Week 2 Lab 1 Part II**. The only difference with that lab is that in Step 5 of the instructions you will need to click on create "(+) New Table" and specify the name of the table you want to create and then click "Next". 

##### Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the CHICAGO PUBLIC SCHOOLS dataset and load the dataset into a new table called **SCHOOLS**.

<a href="https://cognitiveclass.ai"><img src = "https://ibm.box.com/shared/static/uc4xjh1uxcc78ks1i18v668simioz4es.jpg"></a>

In [1]:
import pandas as pd
chicago_schools_data = pd.read_csv('Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012-v3.csv')
#%sql PERSIST chicago_schools_data

In [2]:
import pandas as pd
chicago_schools_data = pd.read_csv('Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012-v3.csv')

### Connect to the database

Let us now load the ipython-sql  extension and establish a connection with the database

In [3]:
%load_ext sql

In [4]:
# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name
%sql postgresql://postgres:SanchezZamudio@localhost:5432/postgres

'Connected: postgres@postgres'

In [5]:
%sql SELECT * FROM chicago_socioeconomic_data limit 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(0, 1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0),
 (1, 2.0, 'West Ridge', 7.8, 17.2, 8.8, 20.8, 38.5, 23040, 46.0),
 (2, 3.0, 'Uptown', 3.8, 24.0, 8.9, 11.8, 22.2, 35787, 20.0),
 (3, 4.0, 'Lincoln Square', 3.4, 10.9, 8.2, 13.4, 25.5, 37524, 17.0),
 (4, 5.0, 'North Center', 0.3, 7.5, 5.2, 4.5, 26.2, 57123, 6.0)]

In [6]:
# type in your query to retrieve list of all tables in the database for your db2 schema (username)
%sql SELECT count(*) FROM chicago_socioeconomic_data WHERE hardship_index > 50 ;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(38,)]

### Query the database system catalog to retrieve table metadata

##### You can verify that the table creation was successful by retrieving the list of all tables in your schema and checking whether the SCHOOLS table was created

In [7]:
%sql SELECT * FROM pg_catalog.pg_tables WHERE schemaname != 'pg_catalog' AND  schemaname != 'information_schema';

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('public', 'petrescue', 'postgres', None, True, False, False, False),
 ('public', 'international_student_test_scores', 'postgres', None, False, False, False, False),
 ('public', 'chicago_socioeconomic_data', 'postgres', None, True, False, False, False),
 ('public', 'chicago_schools_data', 'postgres', None, True, False, False, False)]

<details><summary>Click here for the solution</summary>

```python
#In Db2 the system catalog table called SYSCAT.TABLES contains the table metadata

%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES where TABSCHEMA='YOUR-DB2-USERNAME'

or, you can retrieve list of all tables where the schema name is not one of the system created ones:

%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
      where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')
      
or, just query for a specifc table that you want to verify exists in the database
%sql select * from SYSCAT.TABLES where TABNAME = 'SCHOOLS'
```

</details>

### Query the database system catalog to retrieve column metadata

##### The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [8]:
# type in your query to retrieve the number of columns in the SCHOOLS table
%sql select table_name, count(*) as column_count  from information_schema."columns" where table_schema = 'public' GROUP by table_name order by column_count desc;

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('chicago_schools_data', 79),
 ('chicago_socioeconomic_data', 10),
 ('petrescue', 5),
 ('international_student_test_scores', 4)]

<details><summary>Click here for the solution</summary>

```python
#In Db2 the system catalog table called SYSCAT.COLUMNS contains the column metadata

%sql select count(*) from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'

```

</details>

Now retrieve the the list of columns in SCHOOLS table and their column type (datatype) and length.

In [9]:
# type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length
%sql SELECT column_name FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'chicago_schools_data' ORDER BY column_name;

 * postgresql://postgres:***@localhost:5432/postgres
79 rows affected.

[('10th Grade PLAN (2009) ',),
 ('10th Grade PLAN (2010) ',),
 ('11th Grade Average ACT (2011) ',),
 ('9th Grade EXPLORE (2009) ',),
 ('9th Grade EXPLORE (2010) ',),
 ('AVERAGE_STUDENT_ATTENDANCE',),
 ('Adequate Yearly Progress Made? ',),
 ('Average Teacher Attendance',),
 ('COLLEGE_ENROLLMENT',),
 ('COMMUNITY_AREA_NAME',),
 ('COMMUNITY_AREA_NUMBER',),
 ('CPS Performance Policy Level',),
 ('CPS Performance Policy Status',),
 ('City',),
 ('Collaborative Name',),
 ('College Eligibility %',),
 ('College Enrollment Rate %',),
 ('Elementary, Middle, or High School',),
 ('Environment Icon ',),
 ('Environment Score',),
 ('Family Involvement Icon',),
 ('Family Involvement Score',),
 ('Freshman on Track Rate %',),
 ('General Services Route ',),
 ('Gr-8 Explore Math %',),
 ('Gr-8 Explore Read %',),
 ('Gr3-5 Grade Level Math %',),
 ('Gr3-5 Grade Level Read % ',),
 ('Gr3-5 Keep Pace Math %',),
 ('Gr3-5 Keep Pace Read %',),
 ('Gr6-8 Grade Level Math %',),
 ('Gr6-8 Grade Level Read %',),
 ('Gr6-8 Keep Pace Math%',),
 ('Gr6-8 Keep Pace Read %',),
 ('Graduation Rate %',),
 ('HEALTHY_SCHOOL_CERTIFIED',),
 ('ISAT Exceeding Math %',),
 ('ISAT Exceeding Reading % ',),
 ('ISAT Value Add Color Math',),
 ('ISAT Value Add Color Read',),
 ('ISAT Value Add Math',),
 ('ISAT Value Add Read',),
 ('Individualized Education Program Compliance Rate ',),
 ('Instruction Icon ',),
 ('Instruction Score',),
 ('Latitude',),
 ('Leaders Icon ',),
 ('Leaders Score ',),
 ('Link ',),
 ('Location',),
 ('Longitude',),
 ('NAME_OF_SCHOOL',),
 ('Net Change EXPLORE and PLAN',),
 ('Net Change PLAN and ACT',),
 ('Network Manager',),
 ('Parent Engagement Icon ',),
 ('Parent Engagement Score',),
 ('Parent Environment Icon',),
 ('Parent Environment Score',),
 ('Phone Number',),
 ('Pk-2 Literacy %',),
 ('Pk-2 Math %',),
 ('Police District',),
 ('Rate of Misconducts (per 100 students) ',),
 ('SAFETY_SCORE',),
 ('Safety Icon ',),
 ('School ID',),
 ('State',),
 ('Street Address',),
 ('Students Passing  Algebra %',),
 ('Students Taking  Algebra %',),
 ('Teachers Icon ',),
 ('Teachers Score',),
 ('Track Schedule',),
 ('Ward',),
 ('X_COORDINATE',),
 ('Y_COORDINATE',),
 ('ZIP Code',),
 ('index',)]

<details><summary>Click here for the solution</summary>

```python
%sql select COLNAME, TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'

or

%sql select distinct(NAME), COLTYPE, LENGTH from SYSIBM.SYSCOLUMNS where TBNAME = 'SCHOOLS'

```

</details>

### Questions

1.  Is the column name for the "SCHOOL ID" attribute in upper or mixed case?
2.  What is the name of "Community Area Name" column in your table? Does it have spaces?
3.  Are there any columns in whose names the spaces and paranthesis (round brackets) have been replaced by the underscore character "_"?

## Problems

### Problem 1

##### How many Elementary Schools are in the dataset?

In [10]:
%sql select count(*) from chicago_schools_data where "Elementary, Middle, or High School" = 'ES'

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(462,)]

<details><summary>Click here for the hint</summary>

```python
Which column specifies the school type e.g. 'ES', 'MS', 'HS'?

Does the column name have mixed case, spaces or other special characters?
If so, ensure you use double quotes around the "Name of the Column"

```

</details>

<details><summary>Click here for the solution</summary>

```python
%sql select count(*) from SCHOOLS where "Elementary, Middle, or High School" = 'ES'

Correct answer: 462

```

</details>

### Problem 2

##### What is the highest Safety Score?

In [11]:
%%sql
select max("SAFETY_SCORE") from chicago_schools_data

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(99.0,)]

<details><summary>Click here for the solution</summary>

```python
# Use the MAX() function

%sql select MAX(Safety_Score) AS MAX_SAFETY_SCORE from SCHOOLS

Correct answer: 99
    
```

</details>

### Problem 3

##### Which schools have highest Safety Score?

In [12]:
%%sql
select "NAME_OF_SCHOOL" from chicago_schools_data
where "SAFETY_SCORE" = (select max("SAFETY_SCORE") from chicago_schools_data)

 * postgresql://postgres:***@localhost:5432/postgres
19 rows affected.

[('Abraham Lincoln Elementary School',),
 ('Alexander Graham Bell Elementary School',),
 ('Annie Keller Elementary Gifted Magnet School',),
 ('Augustus H Burley Elementary School',),
 ('Edgar Allan Poe Elementary Classical School',),
 ('Edgebrook Elementary School',),
 ('Ellen Mitchell Elementary School',),
 ('James E McDade Elementary Classical School',),
 ('James G Blaine Elementary School',),
 ('LaSalle Elementary Language Academy',),
 ('Mary E Courtenay Elementary Language Arts Center',),
 ('Northside College Preparatory High School',),
 ('Northside Learning Center High School',),
 ('Norwood Park Elementary School',),
 ('Oriole Park Elementary School',),
 ('Sauganash Elementary School',),
 ('Stephen Decatur Classical Elementary School',),
 ('Talman Elementary School',),
 ('Wildwood Elementary School',)]

<details><summary>Click here for the solution</summary>

```python
# In the previous problem we found out that the highest Safety Score is 99, so we can use that as an input in the where clause:

%sql select Name_of_School, Safety_Score from SCHOOLS where Safety_Score = 99

or, a better way:

%sql select Name_of_School, Safety_Score from SCHOOLS where \
  Safety_Score= (select MAX(Safety_Score) from SCHOOLS)


Correct answer: several schools with with Safety Score of 99.
    
```

</details>

### Problem 4

##### What are the top 10 schools with the highest "Average Student Attendance"?

In [13]:
%%sql
select "NAME_OF_SCHOOL", "AVERAGE_STUDENT_ATTENDANCE"
from chicago_schools_data
where "AVERAGE_STUDENT_ATTENDANCE" is not NULL
order by "AVERAGE_STUDENT_ATTENDANCE" DESC
limit 10

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

<details><summary>Click here for the solution</summary>

```python
%sql select Name_of_School, Average_Student_Attendance from SCHOOLS \
    order by Average_Student_Attendance desc nulls last limit 10 
    
```

</details>

### Problem 5

##### Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [14]:
%%sql
select "NAME_OF_SCHOOL", "AVERAGE_STUDENT_ATTENDANCE"
from chicago_schools_data
where "AVERAGE_STUDENT_ATTENDANCE" is not NULL
order by "AVERAGE_STUDENT_ATTENDANCE" 
limit 5

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

<details><summary>Click here for the solution</summary>

```python
%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

```

</details>

### Problem 6

##### Now remove the '%' sign from the above result set for Average Student Attendance column

In [15]:
%%sql
select "NAME_OF_SCHOOL", REPLACE ("AVERAGE_STUDENT_ATTENDANCE", '%', '' ) as average
from chicago_schools_data
where "AVERAGE_STUDENT_ATTENDANCE" is not NULL
order by "AVERAGE_STUDENT_ATTENDANCE" 
limit 5

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

<details><summary>Click here for the solution</summary>

```python
#Use the REPLACE() function to replace '%' with ''
#See documentation for this function at: 
https://www.ibm.com/support/knowledgecenter/en/SSEPGG_10.5.0/com.ibm.db2.luw.sql.ref.doc/doc/r0000843.html

%sql SELECT Name_of_School, REPLACE(Average_Student_Attendance, '%', '') \
     from SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

```

</details>

### Problem 7

##### Which Schools have Average Student Attendance lower than 70%?

In [16]:
%%sql
select "NAME_OF_SCHOOL", REPLACE ("AVERAGE_STUDENT_ATTENDANCE", '%', '' ) as average
from chicago_schools_data
where "AVERAGE_STUDENT_ATTENDANCE" is not NULL
and REPLACE ("AVERAGE_STUDENT_ATTENDANCE", '%', '' )  < '70'
order by "AVERAGE_STUDENT_ATTENDANCE"

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30'),
 ('Manley Career Academy High School', '66.80'),
 ('Chicago Vocational Career Academy High School', '68.80'),
 ('Roberto Clemente Community Academy High School', '69.60')]

<details><summary>Click here for the hint</summary>

```python
The datatype of the "Average_Student_Attendance" column is varchar.
So you cannot use it as is in the where clause for a numeric comparison.
First use the CAST() function to cast it as a DECIMAL or DOUBLE
e.g. CAST("Column_Name" as DOUBLE)
or simply: DECIMAL("Column_Name")

Don't forget the '%' age sign needs to be removed before casting

```

</details>

<details><summary>Click here for the solution</summary>

```python
%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     where CAST ( REPLACE(Average_Student_Attendance, '%', '') AS DOUBLE ) < 70 \
     order by Average_Student_Attendance
     
or,

%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     where DECIMAL ( REPLACE(Average_Student_Attendance, '%', '') ) < 70 \
     order by Average_Student_Attendance

```

</details>

### Problem 8

##### Get the total College Enrollment for each Community Area

In [19]:
%%sql
select  "COMMUNITY_AREA_NAME", SUM("COLLEGE_ENROLLMENT")
from chicago_schools_data
group by "COMMUNITY_AREA_NAME"
order by "COMMUNITY_AREA_NAME";

 * postgresql://postgres:***@localhost:5432/postgres
77 rows affected.

[('ALBANY PARK', Decimal('6864')),
 ('ARCHER HEIGHTS', Decimal('4823')),
 ('ARMOUR SQUARE', Decimal('1458')),
 ('ASHBURN', Decimal('6483')),
 ('AUBURN GRESHAM', Decimal('4175')),
 ('AUSTIN', Decimal('10933')),
 ('AVALON PARK', Decimal('1522')),
 ('AVONDALE', Decimal('3640')),
 ('BELMONT CRAGIN', Decimal('14386')),
 ('BEVERLY', Decimal('1636')),
 ('BRIDGEPORT', Decimal('3167')),
 ('BRIGHTON PARK', Decimal('9647')),
 ('BURNSIDE', Decimal('549')),
 ('CALUMET HEIGHTS', Decimal('1568')),
 ('CHATHAM', Decimal('5042')),
 ('CHICAGO LAWN', Decimal('7086')),
 ('CLEARING', Decimal('2085')),
 ('DOUGLAS', Decimal('4670')),
 ('DUNNING', Decimal('4568')),
 ('EAST GARFIELD PARK', Decimal('5337')),
 ('EAST SIDE', Decimal('5305')),
 ('EDGEWATER', Decimal('4600')),
 ('EDISON PARK', Decimal('910')),
 ('ENGLEWOOD', Decimal('6832')),
 ('FOREST GLEN', Decimal('1431')),
 ('FULLER PARK', Decimal('531')),
 ('GAGE PARK', Decimal('9915')),
 ('GARFIELD RIDGE', Decimal('4552')),
 ('GRAND BOULEVARD', Decimal('2809')),
 ('GREATER GRAND CROSSING', Decimal('4051')),
 ('HEGEWISCH', Decimal('963')),
 ('HERMOSA', Decimal('3975')),
 ('HUMBOLDT PARK', Decimal('8620')),
 ('HYDE PARK', Decimal('1930')),
 ('IRVING PARK', Decimal('7764')),
 ('JEFFERSON PARK', Decimal('1755')),
 ('KENWOOD', Decimal('4287')),
 ('LAKE VIEW', Decimal('7055')),
 ('LINCOLN PARK', Decimal('5615')),
 ('LINCOLN SQUARE', Decimal('4132')),
 ('LOGAN SQUARE', Decimal('7351')),
 ('LOOP', Decimal('871')),
 ('LOWER WEST SIDE', Decimal('7257')),
 ('MCKINLEY PARK', Decimal('1552')),
 ('MONTCLARE', Decimal('1317')),
 ('MORGAN PARK', Decimal('3271')),
 ('MOUNT GREENWOOD', Decimal('2091')),
 ('NEAR NORTH SIDE', Decimal('3362')),
 ('NEAR SOUTH SIDE', Decimal('1378')),
 ('NEAR WEST SIDE', Decimal('7975')),
 ('NEW CITY', Decimal('7922')),
 ('NORTH CENTER', Decimal('7541')),
 ('NORTH LAWNDALE', Decimal('5146')),
 ('NORTH PARK', Decimal('4210')),
 ('NORWOOD PARK', Decimal('6469')),
 ('OAKLAND', Decimal('140')),
 ('OHARE', Decimal('786')),
 ('PORTAGE PARK', Decimal('6954')),
 ('PULLMAN', Decimal('1620')),
 ('RIVERDALE', Decimal('1547')),
 ('ROGERS PARK', Decimal('4068')),
 ('ROSELAND', Decimal('7020')),
 ('SOUTH CHICAGO', Decimal('4043')),
 ('SOUTH DEERING', Decimal('1859')),
 ('SOUTH LAWNDALE', Decimal('14793')),
 ('SOUTH SHORE', Decimal('4543')),
 ('UPTOWN', Decimal('4388')),
 ('WASHINGTON HEIGHTS', Decimal('4006')),
 ('WASHINGTON PARK', Decimal('2648')),
 ('WEST ELSDON', Decimal('3700')),
 ('WEST ENGLEWOOD', Decimal('5946')),
 ('WEST GARFIELD PARK', Decimal('2622')),
 ('WEST LAWN', Decimal('4207')),
 ('WEST PULLMAN', Decimal('3240')),
 ('WEST RIDGE', Decimal('8197')),
 ('WEST TOWN', Decimal('9429')),
 ('WOODLAWN', Decimal('4206'))]

<details><summary>Click here for the hint</summary>

```python
Verify the exact name of the Enrollment column in the database
Use the SUM() function to add up the Enrollments for each Community Area

Don't forget to group by the Community Area

```

</details>

<details><summary>Click here for the solution</summary>

```python
%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name 

```

</details>

### Problem 9

##### Get the 5 Community Areas with the least total College Enrollment  sorted in ascending order

In [20]:
%%sql
select  "COMMUNITY_AREA_NAME", SUM("COLLEGE_ENROLLMENT")
from chicago_schools_data
group by "COMMUNITY_AREA_NAME"
order by SUM("COLLEGE_ENROLLMENT") ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('OAKLAND', Decimal('140')),
 ('FULLER PARK', Decimal('531')),
 ('BURNSIDE', Decimal('549')),
 ('OHARE', Decimal('786')),
 ('LOOP', Decimal('871'))]

<details><summary>Click here for the solution</summary>

```python
# Order the previous query and limit the number of rows you fetch

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name \
   order by TOTAL_ENROLLMENT asc \
   fetch first 5 rows only

```

</details>

### Problem 10

##### Get the hardship index for the community area which has College Enrollment of 4368

In [27]:
%%sql 
select CD.ca, CPS."COMMUNITY_AREA_NAME", hardship_index,  CPS."COLLEGE_ENROLLMENT" 
from chicago_socioeconomic_data CD, chicago_schools_data CPS 
where CD.ca = CPS."COMMUNITY_AREA_NUMBER" 
and "COLLEGE_ENROLLMENT" = 4368

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(5.0, 'NORTH CENTER', 6.0, 4368)]

<details><summary>Click here for the solution</summary>

```python
# For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table as created in the last lab of Week 3 should already exist

%%sql 
select hardship_index 
   from chicago_socioeconomic_data CD, schools CPS 
   where CD.ca = CPS.community_area_number 
      and college_enrollment = 4368

```

</details>

### Problem 11

##### Get the hardship index for the community area which has the highest value for College Enrollment

In [26]:
%%sql 
select CD.ca, CPS."COMMUNITY_AREA_NAME", hardship_index,  CPS."COLLEGE_ENROLLMENT" 
from chicago_socioeconomic_data CD, chicago_schools_data CPS 
where CD.ca = CPS."COMMUNITY_AREA_NUMBER" 
and "COLLEGE_ENROLLMENT" = (select MAX("COLLEGE_ENROLLMENT") from chicago_schools_data)

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(5.0, 'NORTH CENTER', 6.0, 4368)]

<details><summary>Click here for the solution</summary>

```python
# For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table as created in the last lab of Week 3 should already exist

%sql select ca, community_area_name, hardship_index from chicago_socioeconomic_data \
   where ca in \
   ( select community_area_number from schools order by college_enrollment desc limit 1 )


```

</details>

## Summary

##### In this lab you learned how to work with a real word dataset using SQL and Python. You learned how to query columns with spaces or special characters in their names and with mixed case names. You also used built in database functions and practiced how to sort, limit, and order result sets, as well as used sub-queries and worked with multiple tables.

## Author

<a href="https://www.linkedin.com/in/ravahuja/" target="_blank">Rav Ahuja</a>

## Change Log

| Date (YYYY-MM-DD) | Version | Changed By | Change Description                 |
| ----------------- | ------- | ---------- | ---------------------------------- |
| 2020-08-28        | 2.0     | Lavanya    | Moved lab to course repo in GitLab |

<hr>

## <h3 align="center">  IBM Corporation 2020. All rights reserved. <h3/>